[

{
"iIndex": 0,
"sQuestion": "Joan found 70.0 seashells on the beach. she gave Sam some of her seashells. She has 27.0 seashell left. How many seashells did she give to Sam ?",
"lEquations": [
"70-x=27
"
],
"lSolutions": [ 
"43.0"
 ]
},
{
"iIndex": 1,
"sQuestion": "There were 28.0 bales of hay in the barn. Tim stacked more bales in the barn today. There are now 54.0 bales of hay in the barn. How many bales did he store in the barn ?",
"lEquations": [
"28+x=54
"
],
"lSolutions": [ 
"26.0"
 ]
},
{
"iIndex": 2,
"sQuestion": "After eating at the restaurant, Sally, Sam, and Alyssa decided to divide the bill evenly. If each person paid 45.0 dollars, what was the total of the bill ?",
"lEquations": [
"45*3=x
"
],
"lSolutions": [ 
"135.0"
 ]
},
{
"iIndex": 3,
"sQuestion": "Mary is baking a cake. The recipe wants 8.0 cups of flour. She already put in 2.0 cups. How many more cups does she need to add ?",
"lEquations": [
"8=2+x
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 4,
"sQuestion": "Sara's high school played 12.0 basketball games this year. The team won most of their games. They were defeated during 4.0 games. How many games did they win ?",
"lEquations": [
"12=x+4
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 5,
"sQuestion": "There are 22.0 walnut trees currently in the park. Park workers will plant more walnut trees today. When the workers are finished there will be 55.0 walnut trees in the park. How many walnut trees did the workers plant today ?",
"lEquations": [
"22+x=55
"
],
"lSolutions": [ 
"33.0"
 ]
},
{
"iIndex": 6,
"sQuestion": "Mike had 34.0 peaches left at his roadside fruit stand. He went to the orchard and picked more peaches to stock up the stand. There are now 86.0 peaches at the stand, how many did he pick ?",
"lEquations": [
"34+x=86
"
],
"lSolutions": [ 
"52.0"
 ]
},
{
"iIndex": 7,
"sQuestion": "There were 6.0 roses in the vase. Mary cut some more roses from her flower garden. There are now 16.0 roses in the vase. How many roses did she cut ?",
"lEquations": [
"6+x=16
"
],
"lSolutions": [ 
"10.0"
 ]
},
{
"iIndex": 8,
"sQuestion": "Benny bought a soft drink for 2.0 dollars and 5.0 candy bars. He spent a total of 27.0 dollars. How much did each candy bar cost ?",
"lEquations": [
"2+(5*x)=27
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 9,
"sQuestion": "Benny bought 4.0 new baseball trading cards to add to his collection. The next day his dog ate half of his collection. There are now only 34.0 cards left. How many cards did Benny start with ?",
"lEquations": [
"(x+4)/2=34
"
],
"lSolutions": [ 
"64.0"
 ]
},
{
"iIndex": 10,
"sQuestion": "Alyssa spent half of her allowance going to the movies. She washed the family car and earned 8.0 dollars. What is her weekly allowance if she ended with 12.0 dollars ?",
"lEquations": [
"(x/2)+8=12
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 11,
"sQuestion": "The sum of three consecutive even numbers is 162.0 What is the smallest of the three numbers ?",
"lEquations": [
"(3*x)+6=162
"
],
"lSolutions": [ 
"52.0"
 ]
},
{
"iIndex": 12,
"sQuestion": "Sam had 79.0 dollars to spend on 9.0 books. After buying them he had 16.0 dollars. How much did each book cost ?",
"lEquations": [
"79-(9*x)=16
"
],
"lSolutions": [ 
"7.0"
 ]
},
{
"iIndex": 13,
"sQuestion": "Oceanside Bike Rental Shop charges 17.0 dollars plus 7.0 dollars an hour for renting a bike. Tom paid 80.0 dollars to rent a bike. How many hours did he pay to have the bike checked out ?",
"lEquations": [
"17+(7*x)=80
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 14,
"sQuestion": "On Monday, 375.0 students went on a trip to the zoo. All 7.0 buses were filled and 4.0 students had to travel in cars. How many students were in each bus ?",
"lEquations": [
"375=(7*x)+4
"
],
"lSolutions": [ 
"53.0"
 ]
},
{
"iIndex": 15,
"sQuestion": "Sandy sold half of her comic books and then bought 6.0 more. She now has 13.0 How many did she begin with ?",
"lEquations": [
"(x/2)+6=13
"
],
"lSolutions": [ 
"14.0"
 ]
},
{
"iIndex": 16,
"sQuestion": "The sum of three consecutive odd numbers is 69.0 What is the smallest of the three numbers ?",
"lEquations": [
"(3*x)+6=69
"
],
"lSolutions": [ 
"21.0"
 ]
},
{
"iIndex": 17,
"sQuestion": "Joan went to 4.0 football games this year. She went to 9.0 games last year. How many football games did Joan go to in all ?",
"lEquations": [
"4+9=x
"
],
"lSolutions": [ 
"13.0"
 ]
},
{
"iIndex": 18,
"sQuestion": "Tom has 9.0 yellow balloons Sara has 8.0 yellow balloons. How many yellow balloons do they have in total ?",
"lEquations": [
"9+8=x
"
],
"lSolutions": [ 
"17.0"
 ]
},
{
"iIndex": 19,
"sQuestion": "There are 4.0 walnut trees currently in the park. Park workers will plant 6.0 more walnut trees today. How many walnut trees will the park have when the workers are finished ?",
"lEquations": [
"4+6=x
"
],
"lSolutions": [ 
"10.0"
 ]
},
{
"iIndex": 20,
"sQuestion": "Sam had 9.0 dimes in his bank. His dad gave him 7.0 more dimes. How many dimes does Sam have now ?",
"lEquations": [
"9+7=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 21,
"sQuestion": "Alyssa's dog had puppies. She gave 7.0 to her friends.  She now has 5.0 puppies left. How many puppies did she have to start with ?",
"lEquations": [
"x-7=5
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 22,
"sQuestion": "A restaurant served 9.0 pizzas during lunch and 6.0 during dinner today. How many pizzas were served today ?",
"lEquations": [
"9+6=x
"
],
"lSolutions": [ 
"15.0"
 ]
},
{
"iIndex": 23,
"sQuestion": "There are 2.0 pencils in the drawer. Tim placed 3.0 more pencils in the drawer. How many pencils are now there in total ?",
"lEquations": [
"2+3=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 24,
"sQuestion": "Joan found 6.0 seashells and Jessica found 8.0 seashells on the beach. How many seashells did they find together ?",
"lEquations": [
"6+8=x
"
],
"lSolutions": [ 
"14.0"
 ]
},
{
"iIndex": 25,
"sQuestion": "Sandy grew 6.0 carrots. Sam grew 3.0 carrots. How many carrots did they grow in total ?",
"lEquations": [
"6+3=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 26,
"sQuestion": "Benny picked 2.0 apples and Dan picked 9.0 apples from the apple tree. How many apples were picked in total ?",
"lEquations": [
"2+9=x
"
],
"lSolutions": [ 
"11.0"
 ]
},
{
"iIndex": 27,
"sQuestion": "Sally found 9.0 seashells, Tom found 7.0 seashells, and Jessica found 5.0 seashells on the beach. How many seashells did they find together ?",
"lEquations": [
"9+7+5=x
"
],
"lSolutions": [ 
"21.0"
 ]
},
{
"iIndex": 28,
"sQuestion": "Tim's cat had kittens. He gave 3.0 to Jessica and 6.0 to Sara. He now has 9.0 kittens left. How many kittens did he have to start with ?",
"lEquations": [
"x-3-6=9
"
],
"lSolutions": [ 
"18.0"
 ]
},
{
"iIndex": 29,
"sQuestion": "Joan has 9.0 blue balloons, Sally has 5.0 blue balloons, and Jessica has  2.0 blue balloons. How many blue balloons do they have in total ?",
"lEquations": [
"9+5+2=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 30,
"sQuestion": "Melanie had 7.0 dimes in her bank. Her dad gave her 8.0 dimes and her mother gave her 4.0 dimes. How many dimes does Melanie have now ?",
"lEquations": [
"7+8+4=x
"
],
"lSolutions": [ 
"19.0"
 ]
},
{
"iIndex": 31,
"sQuestion": "A restaurant served 5.0 cakes during lunch and 6.0 during dinner today. The restaurant served 3.0 cakes yesterday. How many cakes were served in total ?",
"lEquations": [
"5+6+3=x
"
],
"lSolutions": [ 
"14.0"
 ]
},
{
"iIndex": 32,
"sQuestion": "Melanie picked 4.0 plums, Dan picked 9.0 plums, and Sally picked 3.0 plums from the plum tree. How many plums were picked in total ?",
"lEquations": [
"4+9+3=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 33,
"sQuestion": "There are 7.0 dogwood trees currently in the park. Park workers will plant 3.0 more dogwood trees today and 2.0 more dogwood trees tomorrow. How many dogwood trees will the park have when the workers are finished ?",
"lEquations": [
"7+3+2=x
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 34,
"sQuestion": "Sara grew 4.0 onions, Sally grew 5.0 onions, and Fred grew  9.0 onions. How many onions did they grow in all ?",
"lEquations": [
"4+5+9=x
"
],
"lSolutions": [ 
"18.0"
 ]
},
{
"iIndex": 35,
"sQuestion": "Sam found 18.0 seashells and Mary found 47.0 seashells on the beach. How many seashells did they find together ?",
"lEquations": [
"18+47=x
"
],
"lSolutions": [ 
"65.0"
 ]
},
{
"iIndex": 36,
"sQuestion": "Sara picked 45.0 pears and Sally picked 11.0 pears from the pear tree. How many pears were picked in total ?",
"lEquations": [
"45+11=x
"
],
"lSolutions": [ 
"56.0"
 ]
},
{
"iIndex": 37,
"sQuestion": "Keith has 20.0 books. Jason has 21.0 books.  How many books do they have together ?",
"lEquations": [
"20+21=x
"
],
"lSolutions": [ 
"41.0"
 ]
},
{
"iIndex": 38,
"sQuestion": "Jason had 49.0 quarters in his bank. His dad gave him 25.0 more quarters. How many quarters does he have now ?",
"lEquations": [
"49+25=x
"
],
"lSolutions": [ 
"74.0"
 ]
},
{
"iIndex": 39,
"sQuestion": "There are 33.0 walnut trees currently in the park. Park workers will plant  44.0 more walnut trees today. How many walnut trees will the park have when the workers are finished ?",
"lEquations": [
"33+44=x
"
],
"lSolutions": [ 
"77.0"
 ]
},
{
"iIndex": 40,
"sQuestion": "Sara had 21.0 quarters in her bank. Her dad gave her 49.0 more quarters. How many quarters does she have now ?",
"lEquations": [
"21+49=x
"
],
"lSolutions": [ 
"70.0"
 ]
},
{
"iIndex": 41,
"sQuestion": "There are 41.0 pencils in the drawer. Mike placed 30.0 more  pencils in the drawer. How many pencils are now there in total ?",
"lEquations": [
"41+30=x
"
],
"lSolutions": [ 
"71.0"
 ]
},
{
"iIndex": 42,
"sQuestion": "Joan has 10.0 books. Tom has 38.0 books.  How many books do they have together ?",
"lEquations": [
"10+38=x
"
],
"lSolutions": [ 
"48.0"
 ]
},
{
"iIndex": 43,
"sQuestion": "Joan has 40.0 blue balloons Melanie has 41.0 blue balloons. How many blue balloons do they have in total ?",
"lEquations": [
"40+41=x
"
],
"lSolutions": [ 
"81.0"
 ]
},
{
"iIndex": 44,
"sQuestion": "Fred grew 38.0 cantelopes. Tim grew 44.0 cantelopes. How many cantelopes did they grow in total ?",
"lEquations": [
"38+44=x
"
],
"lSolutions": [ 
"82.0"
 ]
},
{
"iIndex": 45,
"sQuestion": "Sam went to 14.0 football games this year. He went to 29.0 games  last year. How many football games did Sam go to in all ?",
"lEquations": [
"14+29=x
"
],
"lSolutions": [ 
"43.0"
 ]
},
{
"iIndex": 46,
"sQuestion": "Mary found 18.0 seashells and Jessica found 41.0 seashells on the beach. How many seashells did they find together ?",
"lEquations": [
"18+41=x
"
],
"lSolutions": [ 
"59.0"
 ]
},
{
"iIndex": 47,
"sQuestion": "There are 39.0 dogwood trees currently in the park. Park workers will plant  41.0 more dogwood trees today and 20.0 more dogwood trees tomorrow. How many dogwood trees will the park have when the workers are finished ?",
"lEquations": [
"39+41+20=x
"
],
"lSolutions": [ 
"100.0"
 ]
},
{
"iIndex": 48,
"sQuestion": "Sandy has 10.0 books, Benny has 24.0 books, and Tim has  33.0 books. How many books do they have together ?",
"lEquations": [
"10+24+33=x
"
],
"lSolutions": [ 
"67.0"
 ]
},
{
"iIndex": 49,
"sQuestion": "Jason picked 46.0 pears, Keith picked 47.0 pears, and Mike picked  12.0 pears from the pear tree. How many pears were picked in total ?",
"lEquations": [
"46+47+12=x
"
],
"lSolutions": [ 
"105.0"
 ]
},
{
"iIndex": 50,
"sQuestion": "Keith grew 29.0 cantelopes, Fred grew 16.0 cantelopes, and Jason grew  20.0 cantelopes. How many cantelopes did they grow in total ?",
"lEquations": [
"29+16+20=x
"
],
"lSolutions": [ 
"65.0"
 ]
},
{
"iIndex": 51,
"sQuestion": "Melanie had 19.0 dimes in her bank. Her dad gave her 39.0 dimes and her mother gave her 25.0 dimes. How many dimes does Melanie have now ?",
"lEquations": [
"19+39+25=x
"
],
"lSolutions": [ 
"83.0"
 ]
},
{
"iIndex": 52,
"sQuestion": "Alyssa has 37.0 blue balloons, Sandy has 28.0 blue balloons, and Sally  has 39.0 blue balloons. How many blue balloons do they have in all ?",
"lEquations": [
"37+28+39=x
"
],
"lSolutions": [ 
"104.0"
 ]
},
{
"iIndex": 53,
"sQuestion": "Sally had 27.0 cards. Dan gave her 41.0 new cards. Sally bought 20.0 cards. How many cards does Sally have now ?",
"lEquations": [
"27+41+20=x
"
],
"lSolutions": [ 
"88.0"
 ]
},
{
"iIndex": 54,
"sQuestion": "Jason went to 11.0 football games this month. He went to 17.0 games last month, and plans to go to 16.0 games next month. How many games will he attend in all ?",
"lEquations": [
"11+17+16=x
"
],
"lSolutions": [ 
"44.0"
 ]
},
{
"iIndex": 55,
"sQuestion": "There are 43.0 pencils in the drawer and 19.0 pencils on the desk. Dan placed  16.0 more pencils on the desk. How many pencils are now there in total ?",
"lEquations": [
"43+19+16=x
"
],
"lSolutions": [ 
"78.0"
 ]
},
{
"iIndex": 56,
"sQuestion": "Mike has 35.0 books in his library. He bought several books at a yard sale over the weekend. He now has 56.0 books in his library. How many books did he buy at the yard sale ?",
"lEquations": [
"35+x=56
"
],
"lSolutions": [ 
"21.0"
 ]
},
{
"iIndex": 57,
"sQuestion": "Sandy is baking a cake. The recipe wants 7.0 cups of flour. She already put in 4.0 cups. How many more cups does she need to add ?",
"lEquations": [
"7=4+x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 58,
"sQuestion": "There are 53.0 maple trees currently in the park. Park workers will plant more maple trees today. When the workers are finished there will be 64.0 maple trees in the park. How many maple trees did the workers plant today ?",
"lEquations": [
"53+x=64
"
],
"lSolutions": [ 
"11.0"
 ]
},
{
"iIndex": 59,
"sQuestion": "Dan found 56.0 seashells on the beach, he gave Jessica some of his seashells. He has 22.0 seashell left. How many seashells did he give to Jessica ?",
"lEquations": [
"56-x=22
"
],
"lSolutions": [ 
"34.0"
 ]
},
{
"iIndex": 60,
"sQuestion": "Sally had 13.0 peaches left at her roadside fruit stand. She went to the orchard and picked more peaches to stock up the stand. There are now 55.0 peaches at the stand, how many did she pick ?",
"lEquations": [
"13+x=55
"
],
"lSolutions": [ 
"42.0"
 ]
},
{
"iIndex": 61,
"sQuestion": "Benny received 67.0 dollars for his birthday. He went to a sporting goods store and bought a baseball glove, baseball, and bat. He had 33.0 dollars left over. How much did he spent on the baseball gear ?",
"lEquations": [
"67-x=33
"
],
"lSolutions": [ 
"34.0"
 ]
},
{
"iIndex": 62,
"sQuestion": "There were 3.0 roses in the vase. Alyssa cut some more roses from her flower garden. There are now 14.0 roses in the vase. How many roses did she cut ?",
"lEquations": [
"3+x=14
"
],
"lSolutions": [ 
"11.0"
 ]
},
{
"iIndex": 63,
"sQuestion": "Last week Tom had 74.0 dollars. He washed cars over the weekend and now has 86.0 dollars. How much money did he make washing cars ?",
"lEquations": [
"74+x=86
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 64,
"sQuestion": "There were 73.0 bales of hay in the barn. Jason stacked more bales in the barn today. There are now 96.0 bales of hay in the barn. How many bales did he store in the barn ?",
"lEquations": [
"73+x=96
"
],
"lSolutions": [ 
"23.0"
 ]
},
{
"iIndex": 65,
"sQuestion": "Nancy grew 6.0 potatoes. Sandy grew 7.0 potatoes. How many potatoes did they grow in total ?",
"lEquations": [
"6+7=x
"
],
"lSolutions": [ 
"13.0"
 ]
},
{
"iIndex": 66,
"sQuestion": "There are 9.0 crayons in the drawer. Benny placed 3.0 more crayons in the drawer. How many crayons are now there in total ?",
"lEquations": [
"9+3=x
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 67,
"sQuestion": "There are 5.0 oak trees currently in the park. Park workers will plant 4.0 more oak trees today. How many oak trees will the park have when the workers are finished ?",
"lEquations": [
"5+4=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 68,
"sQuestion": "There were a total of 7.0 football games this year. Melanie missed 4.0 of the games. How many football games did Melanie go to in all ?",
"lEquations": [
"7=4+x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 69,
"sQuestion": "Tom found 7.0 seashells but 4.0 were broken.  How many unbroken seashells did Tom find ?",
"lEquations": [
"7=4+x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 70,
"sQuestion": "Sally picked 7.0 lemons and Mary picked 9.0 lemons from the lemon tree. How many lemons were picked in total ?",
"lEquations": [
"7+9=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 71,
"sQuestion": "A restaurant served 6.0 cakes during lunch and 9.0 during dinner today. How many cakes were served today ?",
"lEquations": [
"6+9=x
"
],
"lSolutions": [ 
"15.0"
 ]
},
{
"iIndex": 72,
"sQuestion": "Joan has 8.0 orange balloons  but lost 2.0 of them. How many orange balloons does Joan have now ?",
"lEquations": [
"8-2=x
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 73,
"sQuestion": "Fred had 7.0 dimes in his bank. His sister borrowed 3.0 of his dimes. How many dimes does Fred have now ?",
"lEquations": [
"7-3=x
"
],
"lSolutions": [ 
"4.0"
 ]
},
{
"iIndex": 74,
"sQuestion": "Joan's cat had 8.0 kittens. She gave 2.0 to her friends.  How many kittens does she have now ?",
"lEquations": [
"8-2=x
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 75,
"sQuestion": "There are 34.0 dogwood trees currently in the park. Park workers will plant  49.0 more dogwood trees today. How many dogwood trees will the park have when the workers are finished ?",
"lEquations": [
"34+49=x
"
],
"lSolutions": [ 
"83.0"
 ]
},
{
"iIndex": 76,
"sQuestion": "There are 27.0 pencils in the drawer. Nancy placed 45.0 more  pencils in the drawer. How many pencils are now there in total ?",
"lEquations": [
"27+45=x
"
],
"lSolutions": [ 
"72.0"
 ]
},
{
"iIndex": 77,
"sQuestion": "Benny's high school played 39.0 baseball games this year. He attended  14.0 games. How many baseball games did Benny miss ?",
"lEquations": [
"39-14=x
"
],
"lSolutions": [ 
"25.0"
 ]
},
{
"iIndex": 78,
"sQuestion": "Sam found 35.0 seashells on the beach, he gave Joan 18.0 of the seashells. How many seashells does he now have ?",
"lEquations": [
"35-18=x
"
],
"lSolutions": [ 
"17.0"
 ]
},
{
"iIndex": 79,
"sQuestion": "Tim has 22.0 books. Mike has 20.0 books.  How many books do they have together ?",
"lEquations": [
"22+20=x
"
],
"lSolutions": [ 
"42.0"
 ]
},
{
"iIndex": 80,
"sQuestion": "Mike has 87.0 baseball cards. Sam bought 13.0 of Mike's  baseball cards. How many baseball cards does Mike have now ?",
"lEquations": [
"87-13=x
"
],
"lSolutions": [ 
"74.0"
 ]
},
{
"iIndex": 81,
"sQuestion": "Sandy grew 51.0 pumpkins. Mike grew 23.0 pumpkins. How many pumpkins did they grow in total ?",
"lEquations": [
"51+23=x
"
],
"lSolutions": [ 
"74.0"
 ]
},
{
"iIndex": 82,
"sQuestion": "Tim has 44.0 books. Sam has 52.0 books.  How many books do they have together ?",
"lEquations": [
"44+52=x
"
],
"lSolutions": [ 
"96.0"
 ]
},
{
"iIndex": 83,
"sQuestion": "Dan has 64.0 violet marbles, he gave Mary 14.0 of the marbles. How many violet marbles does he now have ?",
"lEquations": [
"64-14=x
"
],
"lSolutions": [ 
"50.0"
 ]
},
{
"iIndex": 84,
"sQuestion": "There are 25.0 popular trees currently in the park. Park workers will plant  73.0 more popular trees today. How many popular trees will the park have when the workers are finished ?",
"lEquations": [
"25+73=x
"
],
"lSolutions": [ 
"98.0"
 ]
},
{
"iIndex": 85,
"sQuestion": "There are 54.0 scissors in the drawer. Keith placed 22.0 more  scissors in the drawer. How many scissors are now there in all ?",
"lEquations": [
"54+22=x
"
],
"lSolutions": [ 
"76.0"
 ]
},
{
"iIndex": 86,
"sQuestion": "Alyssa picked 42.0 pears and Nancy picked 17.0 pears from the pear tree. How many pears were picked in all ?",
"lEquations": [
"42+17=x
"
],
"lSolutions": [ 
"59.0"
 ]
},
{
"iIndex": 87,
"sQuestion": "Sam had 98.0 pennies in his bank. He spent 93.0 of his pennies. How many pennies does he have now ?",
"lEquations": [
"98-93=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 88,
"sQuestion": "Joan found 79.0 seashells on the beach, she gave Mike 63.0 of the seashells. How many seashells does she now have ?",
"lEquations": [
"79-63=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 89,
"sQuestion": "Melanie's high school played 64.0 soccer games this year. She attended  32.0 games. How many soccer games did Melanie miss ?",
"lEquations": [
"64=32+x
"
],
"lSolutions": [ 
"32.0"
 ]
},
{
"iIndex": 90,
"sQuestion": "Sam has 110.0 books. Joan has 102.0 books.  How many books do they have together ?",
"lEquations": [
"110+102=x
"
],
"lSolutions": [ 
"212.0"
 ]
},
{
"iIndex": 91,
"sQuestion": "Mary picked 122.0 oranges and Jason picked 105.0 oranges from the orange tree. How many oranges were picked in total ?",
"lEquations": [
"122+105=x
"
],
"lSolutions": [ 
"227.0"
 ]
},
{
"iIndex": 92,
"sQuestion": "Sally had 760.0 quarters in her bank. She spent 418.0 of her quarters. How many quarters does she have now ?",
"lEquations": [
"760-418=x
"
],
"lSolutions": [ 
"342.0"
 ]
},
{
"iIndex": 93,
"sQuestion": "Fred's high school played 616.0 baseball games this year. He attended  147.0 games. How many baseball games did Fred miss ?",
"lEquations": [
"616=147+x
"
],
"lSolutions": [ 
"469.0"
 ]
},
{
"iIndex": 94,
"sQuestion": "Melanie grew 139.0 turnips. Benny grew 113.0 turnips. How many turnips did they grow in all ?",
"lEquations": [
"139+113=x
"
],
"lSolutions": [ 
"252.0"
 ]
},
{
"iIndex": 95,
"sQuestion": "Jason has 676.0 Pokemon cards. Alyssa bought 224.0 of Jason's  Pokemon cards. How many Pokemon cards does Jason have now ?",
"lEquations": [
"676-224=x
"
],
"lSolutions": [ 
"452.0"
 ]
},
{
"iIndex": 96,
"sQuestion": "There are 107.0 walnut trees currently in the park. Park workers will plant  104.0 more walnut trees today. How many walnut trees will the park have when the workers are finished ?",
"lEquations": [
"107+104=x
"
],
"lSolutions": [ 
"211.0"
 ]
},
{
"iIndex": 97,
"sQuestion": "Fred has 709.0 green balloons, he gave Sandy 221.0 of the balloons. How many green balloons does he now have ?",
"lEquations": [
"709-221=x
"
],
"lSolutions": [ 
"488.0"
 ]
},
{
"iIndex": 98,
"sQuestion": "There are 115.0 pencils in the drawer. Sara placed 100.0 more  pencils in the drawer. How many pencils are now there in all ?",
"lEquations": [
"115+100=x
"
],
"lSolutions": [ 
"215.0"
 ]
},
{
"iIndex": 99,
"sQuestion": "Mike has 45.0 dollars in five dollar bills.  How many five dollars bills does  he have ?",
"lEquations": [
"45/5=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 100,
"sQuestion": "Nancy goes fishing with Joan. They catch 18.0 trout.  If they equally split up the trout, how may will each one get ?",
"lEquations": [
"18/2=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 101,
"sQuestion": "A restaurant sold 63.0 hamburgers last week. How many hamburgers on average were sold each day ?",
"lEquations": [
"63/7=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 102,
"sQuestion": "Sandy worked 45.0 hours in the last five days. Assuming that she worked the same amount of hours each day, how long did she work each day ?",
"lEquations": [
"45/5=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 103,
"sQuestion": "There were a total of 27.0 soccer games during the three month season.  If the games are equally divided, how many soccer games are played a month ?",
"lEquations": [
"27/3=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 104,
"sQuestion": "Fred has 90.0 cents in his bank.  How many dimes does Fred have ?",
"lEquations": [
"90/10=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 105,
"sQuestion": "Fred has 110.0 blue marbles. Fred has 22.0 times more blue marbles than Tim. How many blue marbles does Tim have?",
"lEquations": [
"110/22=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 106,
"sQuestion": "There are 390.0 students at a school. If each classroom holds 30.0 students, how many classrooms are needed at the school?",
"lEquations": [
"390=30*x
"
],
"lSolutions": [ 
"13.0"
 ]
},
{
"iIndex": 107,
"sQuestion": "Mike has 96.0 muffins, which he needs to box up into dozens. How many boxes does he need?",
"lEquations": [
"96/12=x
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 108,
"sQuestion": "Tim has saved 2000.0 cents from selling lemonade.  How many dollars does Tim have?",
"lEquations": [
"2000/100=x
"
],
"lSolutions": [ 
"20.0"
 ]
},
{
"iIndex": 109,
"sQuestion": "Jason's shelves hold 45.0 books each. How many shelves will Jason need if Jason has 315.0 books?",
"lEquations": [
"45*x=315
"
],
"lSolutions": [ 
"7.0"
 ]
},
{
"iIndex": 110,
"sQuestion": "Nancy bought 615.0 crayons that came in packs of 15.0  How many packs of crayons did Nancy buy?",
"lEquations": [
"615/15=x
"
],
"lSolutions": [ 
"41.0"
 ]
},
{
"iIndex": 111,
"sQuestion": "Mary earns $46 cleaning a home. How many homes did she clean, if she made 276.0 dollars?",
"lEquations": [
"46*x=276
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 112,
"sQuestion": "There were a total of 323.0 football games in the season. The season is played for 17.0 months. How many football games were played each month, if each month has the same number of games?",
"lEquations": [
"323/17=x
"
],
"lSolutions": [ 
"19.0"
 ]
},
{
"iIndex": 113,
"sQuestion": "Nancy, Melanie, Mary, and Alyssa each bought 540.0 baseball cards,  which come in packs of 20.0 How many packs of baseball cards do they have in all?",
"lEquations": [
"(4*540)/20=x
"
],
"lSolutions": [ 
"108.0"
 ]
},
{
"iIndex": 114,
"sQuestion": "A teacher has 344.0 pieces of candy. If there are 43.0 students, and the candy is divided evenly, How many pieces will each student get?",
"lEquations": [
"344/43=x
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 115,
"sQuestion": "Sally earns $25.00 for each house she cleans. If she cleans 96.0 houses, how many dozens of dollars will she make?",
"lEquations": [
"(25*96)=x*12
"
],
"lSolutions": [ 
"200.0"
 ]
},
{
"iIndex": 116,
"sQuestion": "There are 60.0 calories in a candy bar. How many dozen calories are there in 45.0 candy bars?",
"lEquations": [
"60*45=x*12
"
],
"lSolutions": [ 
"225.0"
 ]
},
{
"iIndex": 117,
"sQuestion": "Sara saw 96.0 birds in a tree. How many dozen birds did Sara see?",
"lEquations": [
"96=x*12
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 118,
"sQuestion": "Melanie has 84.0 blue marbles. Sandy has 8.0 times more blue marbles than Melanie. How many dozen blue marbles does Sandy have?",
"lEquations": [
"84*8=x*12
"
],
"lSolutions": [ 
"56.0"
 ]
},
{
"iIndex": 119,
"sQuestion": "Sara has 192.0 golf balls. How many dozen golf balls does she have?",
"lEquations": [
"192=x*12
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 120,
"sQuestion": "Keith bought 72.0 eggs from the store to bake some cakes.  How many dozen eggs did Keith buy?",
"lEquations": [
"72=x*12
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 121,
"sQuestion": "Mike has 48.0 books. Alyssa has 8.0 times more books than  Mike. How many dozen books does Alyssa have?",
"lEquations": [
"48*8=x*12
"
],
"lSolutions": [ 
"32.0"
 ]
},
{
"iIndex": 122,
"sQuestion": "Sara has saved 9.0 dollars from washing cars.  How many dozen quarters does Sara have?",
"lEquations": [
"9=(0.25*12)*x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 123,
"sQuestion": "Sara, Keith, Benny, and Alyssa each have 96.0 baseball cards.  How many dozen baseball cards do they have in all?",
"lEquations": [
"4*96=x*12
"
],
"lSolutions": [ 
"32.0"
 ]
},
{
"iIndex": 124,
"sQuestion": "Jason has 3.0 Pokemon cards. Benny bought 2.0 of Jason's  Pokemon cards. How many Pokemon cards does Jason have now ?",
"lEquations": [
"3-2=x
"
],
"lSolutions": [ 
"1.0"
 ]
},
{
"iIndex": 125,
"sQuestion": "Mike has 8.0 orange marbles, he gave Sam 4.0 of the marbles. How many orange marbles does he now have ?",
"lEquations": [
"8-4=x
"
],
"lSolutions": [ 
"4.0"
 ]
},
{
"iIndex": 126,
"sQuestion": "Joan had 5.0 dimes in her bank. She spent 2.0 of her dimes. How many dimes does she have now ?",
"lEquations": [
"5-2=x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 127,
"sQuestion": "There are 2.0 rose bushes currently in the park. Park workers will plant 4.0 more rose bushes today. How many rose bushes will the park have when the workers are finished ?",
"lEquations": [
"2+4=x
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 128,
"sQuestion": "Sara picked 6.0 pears and Tim picked 5.0 pears from the pear tree. How many pears were picked in total ?",
"lEquations": [
"6+5=x
"
],
"lSolutions": [ 
"11.0"
 ]
},
{
"iIndex": 129,
"sQuestion": "Sam grew 4.0 watermelons, but the rabbits ate 3.0 watermelons. How many watermelons does Sam have left ?",
"lEquations": [
"4-3=x
"
],
"lSolutions": [ 
"1.0"
 ]
},
{
"iIndex": 130,
"sQuestion": "There are 3.0 calories in a candy bar. How many calories are there in 5.0 candy bars ?",
"lEquations": [
"3*5=x
"
],
"lSolutions": [ 
"15.0"
 ]
},
{
"iIndex": 131,
"sQuestion": "Dan has 5.0 blue marbles. Mary has 2.0 times more blue marbles than Dan. How many blue marbles does Mary have ?",
"lEquations": [
"5*2=x
"
],
"lSolutions": [ 
"10.0"
 ]
},
{
"iIndex": 132,
"sQuestion": "Sara has 9.0 dozen golf balls. How many golf balls does she have ?",
"lEquations": [
"9*12=x
"
],
"lSolutions": [ 
"108.0"
 ]
},
{
"iIndex": 133,
"sQuestion": "Jason had Pokemon cards. He gave 9.0 to his friends. He now has 4.0 Pokemon cards left. How many Pokemon cards did he have to start with ?",
"lEquations": [
"x-9=4
"
],
"lSolutions": [ 
"13.0"
 ]
},
{
"iIndex": 134,
"sQuestion": "Mary had 7.0 nickels in her bank. Her dad gave her 5.0 more nickels. How many nickels does Mary have now ?",
"lEquations": [
"7+5=x
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 135,
"sQuestion": "Melanie, Benny, Sally, and Jessica each have 3.0 baseball cards.  How many baseball cards do they have in all ?",
"lEquations": [
"4*3=x
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 136,
"sQuestion": "Keith grew 6.0 turnips. Alyssa grew 9.0 turnips. How many turnips did they grow in all ?",
"lEquations": [
"6+9=x
"
],
"lSolutions": [ 
"15.0"
 ]
},
{
"iIndex": 137,
"sQuestion": "There are 4.0 children in the classroom, each student will get 2.0 pencils. How many pencils will the teacher have to give out ?",
"lEquations": [
"4*2=x
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 138,
"sQuestion": "Mary has 9.0 yellow marbles Joan has 3.0 yellow marbles. How many yellow marbles do they have in all ?",
"lEquations": [
"9+3=x
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 139,
"sQuestion": "There are 8.0 calories in a candy bar. How many calories are there in 3.0 candy bars ?",
"lEquations": [
"8*3=x
"
],
"lSolutions": [ 
"24.0"
 ]
},
{
"iIndex": 140,
"sQuestion": "Joan has saved 6.0 quarters from washing cars.  How many cents does Joan have ?",
"lEquations": [
"6*25=x
"
],
"lSolutions": [ 
"150.0"
 ]
},
{
"iIndex": 141,
"sQuestion": "There are 960.0 students at a school. If each classroom holds 30.0 students, how many classrooms are needed at the school?",
"lEquations": [
"960=30*x
"
],
"lSolutions": [ 
"32.0"
 ]
},
{
"iIndex": 142,
"sQuestion": "Sally earns $12.50 an hour cleaning houses. If she works for 12.0 hours, how much money will she make ?",
"lEquations": [
"12.50*12=x
"
],
"lSolutions": [ 
"150.0"
 ]
},
{
"iIndex": 143,
"sQuestion": "There were a total of 12.0 basketball games in the season. The season is played for 2.0 months. How many basketball games were played each month, if each month has the same number of games?",
"lEquations": [
"12=2*x
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 144,
"sQuestion": "Joan bought 6.0 dozen eggs from the grocery store to bake some cakes.  How many eggs did Joan buy ?",
"lEquations": [
"6*12=x
"
],
"lSolutions": [ 
"72.0"
 ]
},
{
"iIndex": 145,
"sQuestion": "Mary, Sam, Keith, and Alyssa each have 6.0 baseball cards.  How many baseball cards do they have in all ?",
"lEquations": [
"4*6=x
"
],
"lSolutions": [ 
"24.0"
 ]
},
{
"iIndex": 146,
"sQuestion": "Sally bought 4.0 dozen eggs from the grocery store to bake some cakes.  How many eggs did Sally buy ?",
"lEquations": [
"4*12=x
"
],
"lSolutions": [ 
"48.0"
 ]
},
{
"iIndex": 147,
"sQuestion": "There are 1110.0 students at a school. If each classroom holds 30.0 students, how many classrooms are needed at the school?",
"lEquations": [
"1110=30*x
"
],
"lSolutions": [ 
"37.0"
 ]
},
{
"iIndex": 148,
"sQuestion": "Sally grew 6.0 carrots. Fred grew 4.0 carrots. How many carrots did they grow in all ?",
"lEquations": [
"6+4=x
"
],
"lSolutions": [ 
"10.0"
 ]
},
{
"iIndex": 149,
"sQuestion": "Benny has 6.0 blue marbles. Keith has 5.0 times more blue marbles than Benny. How many blue marbles does Keith have ?",
"lEquations": [
"6*5=x
"
],
"lSolutions": [ 
"30.0"
 ]
},
{
"iIndex": 150,
"sQuestion": "Fred earns $12.50 an hour cleaning houses. If he works for 8.0 hours, how much money will he make ?",
"lEquations": [
"12.50*8=x
"
],
"lSolutions": [ 
"100.0"
 ]
},
{
"iIndex": 151,
"sQuestion": "Tom found 5.0 seashells on the beach. he gave Jessica 2.0 of the seashells. How many seashells does he now have ?",
"lEquations": [
"5-2=x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 152,
"sQuestion": "Fred has 5.0 baseball cards. Melanie bought 3.0 of Fred's  baseball cards. How many baseball cards does Fred have now ?",
"lEquations": [
"5-3=x
"
],
"lSolutions": [ 
"2.0"
 ]
},
{
"iIndex": 153,
"sQuestion": "Nancy has saved 4900.0 cents from selling lemonade.  How many dollars does Nancy have?",
"lEquations": [
"4900/100=x
"
],
"lSolutions": [ 
"49.0"
 ]
},
{
"iIndex": 154,
"sQuestion": "There were a total of 10.0 soccer games in the season. The season is played for 5.0 months. How many soccer games were played each month, if each month has the same number of games?",
"lEquations": [
"10=5*x
"
],
"lSolutions": [ 
"2.0"
 ]
},
{
"iIndex": 155,
"sQuestion": "Benny goes out to lunch with Sara and Tom. Each person orders the $8 lunch special. Benny agrees to pay the bill. How much will he have to pay ?",
"lEquations": [
"3*8=x
"
],
"lSolutions": [ 
"24.0"
 ]
},
{
"iIndex": 156,
"sQuestion": "Melanie goes fishing with Tom. Melanie catches 8.0 trout. Tom catches twice as many trout as Melanie. How many trout did Tom catch ?",
"lEquations": [
"8*2=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 157,
"sQuestion": "Tom was at the beach for five days and found 7.0 seashells every day. How many seashells did Tom find during the beach trip ?",
"lEquations": [
"5*7=x
"
],
"lSolutions": [ 
"35.0"
 ]
},
{
"iIndex": 158,
"sQuestion": "Benny worked 3.0 hours for 6.0 days. How many hours did he work in total ?",
"lEquations": [
"3*6=x
"
],
"lSolutions": [ 
"18.0"
 ]
},
{
"iIndex": 159,
"sQuestion": "A restaurant sold 8.0 pies every day for a week. How many pies were sold during the week ?",
"lEquations": [
"8*7=x
"
],
"lSolutions": [ 
"56.0"
 ]
},
{
"iIndex": 160,
"sQuestion": "Nancy has 9.0 five dollars bills.  How much money does she have ?",
"lEquations": [
"9*5=x
"
],
"lSolutions": [ 
"45.0"
 ]
},
{
"iIndex": 161,
"sQuestion": "Nancy has 7.0 black balloons. Mary has 4.0 times more  black balloons than Nancy. How many black balloons does Mary have now ?",
"lEquations": [
"7*4=x
"
],
"lSolutions": [ 
"28.0"
 ]
},
{
"iIndex": 162,
"sQuestion": "Jessica, Sandy, and Jason each have 8.0 pencils. How many pencils do they have have in all ?",
"lEquations": [
"3*8=x
"
],
"lSolutions": [ 
"24.0"
 ]
},
{
"iIndex": 163,
"sQuestion": "Sam, Dan, Tom, and Keith each have 14.0 Pokemon cards.  How many Pokemon cards do they have in all ?",
"lEquations": [
"4*14=x
"
],
"lSolutions": [ 
"56.0"
 ]
},
{
"iIndex": 164,
"sQuestion": "Alyssa has 36.0 books. Nancy has 7.0 times more books than  Alyssa. How many books does Nancy have ?",
"lEquations": [
"36*7=x
"
],
"lSolutions": [ 
"252.0"
 ]
},
{
"iIndex": 165,
"sQuestion": "Tim has 13.0 dozen golf balls. How many golf balls does he have ?",
"lEquations": [
"13*12=x
"
],
"lSolutions": [ 
"156.0"
 ]
},
{
"iIndex": 166,
"sQuestion": "There were a total of 13.0 hockey games a month. The season is played for  14.0 months. How many hockey games are in the seasons ?",
"lEquations": [
"13*14=x
"
],
"lSolutions": [ 
"182.0"
 ]
},
{
"iIndex": 167,
"sQuestion": "Benny bought 7.0 dozen eggs from the grocery store to bake some cakes.  How many eggs did Benny buy ?",
"lEquations": [
"7*12=x
"
],
"lSolutions": [ 
"84.0"
 ]
},
{
"iIndex": 168,
"sQuestion": "Dan has 29.0 violet balloons. Tim has 7.0 times more violet balloons than Dan. How many violet balloons does Tim have ?",
"lEquations": [
"29*7=x
"
],
"lSolutions": [ 
"203.0"
 ]
},
{
"iIndex": 169,
"sQuestion": "There are 31.0 calories in a candy bar. How many calories are there in 11.0 candy bars ?",
"lEquations": [
"31*11=x
"
],
"lSolutions": [ 
"341.0"
 ]
},
{
"iIndex": 170,
"sQuestion": "Sara has saved 11.0 quarters from washing cars.  How many cents does Sara have ?",
"lEquations": [
"11*25=x
"
],
"lSolutions": [ 
"275.0"
 ]
},
{
"iIndex": 171,
"sQuestion": "There are 46.0 children in the classroom, each student will get 4.0 dozen pencils. How many pencils will the teacher have to give out ?",
"lEquations": [
"46*(4*12)=x
"
],
"lSolutions": [ 
"2208.0"
 ]
},
{
"iIndex": 172,
"sQuestion": "Nancy has saved 1.0 dozen quarters from washing cars.  How much money does Nancy have ?",
"lEquations": [
"(12*0.25)=x
"
],
"lSolutions": [ 
"3.0"
 ]
},
{
"iIndex": 173,
"sQuestion": "Dan bought 9.0 dozen eggs from the grocery store to bake some cakes.  How many eggs did Dan buy ?",
"lEquations": [
"9*12=x
"
],
"lSolutions": [ 
"108.0"
 ]
},
{
"iIndex": 174,
"sQuestion": "There are 4.0 dozen calories in a candy bar. How many calories are there in 42.0 candy bars ?",
"lEquations": [
"(4*12)*42=x
"
],
"lSolutions": [ 
"2016.0"
 ]
},
{
"iIndex": 175,
"sQuestion": "Sandy has 8.0 dozen books. Fred has 5.0 times more books than  Sandy. How many books does Fred have ?",
"lEquations": [
"(8*12)*5=x
"
],
"lSolutions": [ 
"480.0"
 ]
},
{
"iIndex": 176,
"sQuestion": "Jessica has 3.0 dozen red marbles. Sandy has 4.0 times more red marbles than Jessica. How many red marbles does Sandy have ?",
"lEquations": [
"(3*12)*4=x
"
],
"lSolutions": [ 
"144.0"
 ]
},
{
"iIndex": 177,
"sQuestion": "Melanie, Benny, Sandy, and Jessica each have 9.0 dozen Pokemon cards.  How many Pokemon cards do they have in all ?",
"lEquations": [
"4*(9*12)=x
"
],
"lSolutions": [ 
"432.0"
 ]
},
{
"iIndex": 178,
"sQuestion": "Sally saw 1.0 dozen birds in a tree. How many birds did Sally see ?",
"lEquations": [
"1*12=x
"
],
"lSolutions": [ 
"12.0"
 ]
},
{
"iIndex": 179,
"sQuestion": "Fred, Benny, and Jason have 24.0 crayons all together. If the crayons are equally divided, how many will each person get ?",
"lEquations": [
"24/3=x
"
],
"lSolutions": [ 
"8.0"
 ]
},
{
"iIndex": 180,
"sQuestion": "Sara goes fishing with Melanie. Sara catches 5.0 trout. Melanie catches twice as many trout as Sara. How many trout did Melanie catch ?",
"lEquations": [
"5*2=x
"
],
"lSolutions": [ 
"10.0"
 ]
},
{
"iIndex": 181,
"sQuestion": "Benny goes to lunch with Sally and Sandy. The total bill came to 15.0 dollars. They decided to equally split up the bill, how much will each person have to pay ?",
"lEquations": [
"15/3=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 182,
"sQuestion": "A restaurant sold 49.0 hamburgers last week. How many hamburgers on average were sold each day ?",
"lEquations": [
"49/7=x
"
],
"lSolutions": [ 
"7.0"
 ]
},
{
"iIndex": 183,
"sQuestion": "Sally has 6.0 blue balloons. Fred has 3.0 times more  blue balloons than Sally. How many blue balloons does Fred have now ?",
"lEquations": [
"6*3=x
"
],
"lSolutions": [ 
"18.0"
 ]
},
{
"iIndex": 184,
"sQuestion": "Mike worked 3.0 hours, each day, for 5.0 days. How many hours did he work in total ?",
"lEquations": [
"3*5=x
"
],
"lSolutions": [ 
"15.0"
 ]
},
{
"iIndex": 185,
"sQuestion": "There were a total of 7.0 baseball games a month.  The season is played for 2.0 months. How many baseball games are in a season ?",
"lEquations": [
"7*2=x
"
],
"lSolutions": [ 
"14.0"
 ]
},
{
"iIndex": 186,
"sQuestion": "Melanie is selling 4.0 gumballs for eight cents each. How much money can Melanie get from selling the gumballs?",
"lEquations": [
"4*8=x
"
],
"lSolutions": [ 
"32.0"
 ]
},
{
"iIndex": 187,
"sQuestion": "Mary had 8.0 potatoes in the garden. The rabbits ate 3.0 of the potatoes. How many potatoes does Mary now have ?",
"lEquations": [
"8-3=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 188,
"sQuestion": "There were a total of 6.0 soccer games this year. Jessica missed 4.0 of the games. How many soccer games did Jessica go to in all ?",
"lEquations": [
"6=4+x
"
],
"lSolutions": [ 
"2.0"
 ]
},
{
"iIndex": 189,
"sQuestion": "There are 9.0 oak trees currently in the park. Park workers had to cut down 2.0  oak trees that were damaged. How many oak trees will the park have when the workers are finished ?",
"lEquations": [
"9-2=x
"
],
"lSolutions": [ 
"7.0"
 ]
},
{
"iIndex": 190,
"sQuestion": "Jessica had 8.0 quarters in her bank. Her sister borrowed 3.0 of her quarters. How many quarters does Jessica have now ?",
"lEquations": [
"8-3=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 191,
"sQuestion": "A restaurant made 9.0 hamburgers to serve during lunch. Only 3.0 were  actually served. How many hamburgers were left over from lunch ?",
"lEquations": [
"9=3+6
"
],
"lSolutions": [ 
"6.0"
 ]
},
{
"iIndex": 192,
"sQuestion": "There are 7.0 crayons in the drawer. Mary took 3.0 crayons out of the drawer. How many crayons are there now ?",
"lEquations": [
"7-3=x
"
],
"lSolutions": [ 
"4.0"
 ]
},
{
"iIndex": 193,
"sQuestion": "Dan picked 9.0 limes and gave Sara 4.0 of the limes.  How many limes does Dan have now ?",
"lEquations": [
"9-4=x
"
],
"lSolutions": [ 
"5.0"
 ]
},
{
"iIndex": 194,
"sQuestion": "Dan found 7.0 seashells but 3.0 were broken.  How many unbroken seashells did Dan find ?",
"lEquations": [
"7=3+x
"
],
"lSolutions": [ 
"4.0"
 ]
},
{
"iIndex": 195,
"sQuestion": "Joan has 9.0 blue balloons  but lost 2.0 of them. How many blue balloons does Joan have now ?",
"lEquations": [
"9-2=x
"
],
"lSolutions": [ 
"7.0"
 ]
},
{
"iIndex": 196,
"sQuestion": "Joan picked 43.0 apples from the orchard, and gave 27.0 apples  to  Melanie. How many apples does Joan have now ?",
"lEquations": [
"43-27=x
"
],
"lSolutions": [ 
"16.0"
 ]
},
{
"iIndex": 197,
"sQuestion": "Alyssa's high school played 31.0 hockey games this year. She attended  13.0 games. How many hockey games did Alyssa miss ?",
"lEquations": [
"31=13+x
"
],
"lSolutions": [ 
"18.0"
 ]
},
{
"iIndex": 198,
"sQuestion": "Tom has 30.0 violet balloons, he gave Fred 16.0 of the balloons. How many violet balloons does he now have ?",
"lEquations": [
"30-16=x
"
],
"lSolutions": [ 
"14.0"
 ]
},
{
"iIndex": 199,
"sQuestion": "Fred has 40.0 baseball cards. Keith bought 22.0 of Fred's  baseball cards. How many baseball cards does Fred have now ?",
"lEquations": [
"40-22=x
"
],
"lSolutions": [ 
"18.0"
 ]
},
{
"iIndex": 200,
"sQuestion": "Fred found 47.0 seashells on the beach, he gave Jessica 25.0 of the seashells. How many seashells does he now have ?",
"lEquations": [
"47-25=x
"
],
"lSolutions": [ 
"22.0"
 ]
},
{
"iIndex": 201,
"sQuestion": "Sara grew 43.0 pumpkins, but the rabbits ate 23.0 pumpkins. How many pumpkins does Sara have left ?",
"lEquations": [
"43-23=x
"
],
"lSolutions": [ 
"20.0"
 ]
},
{
"iIndex": 202,
"sQuestion": "Joan decided to sell all of her old books. She gathered up 33.0 books to sell. She sold 26.0 books in a yard sale. How many books does Joan now have ?",
"lEquations": [
"33-26=x
"
],
"lSolutions": [ 
"7.0"
 ]
},
{
"iIndex": 203,
"sQuestion": "There are 46.0 rulers in the drawer. Tim took 25.0  rulers from the drawer. How many rulers are now in the drawer ?",
"lEquations": [
"46-25=x
"
],
"lSolutions": [ 
"21.0"
 ]
},
{
"iIndex": 204,
"sQuestion": "There are 33.0 oak trees currently in the park. Park workers had to cut down  18.0 oak trees that were damaged. How many oak trees will be in the park when the workers are finished ?",
"lEquations": [
"33-18=x
"
],
"lSolutions": [ 
"15.0"
 ]
},
{
"iIndex": 205,
"sQuestion": "Sandy sold lemonade in her neighborhood. She got 17.0 half-dollars on Saturday and 6.0 half-dollars on Sunday. What amount of money did Sandy receive?",
"lEquations": [
"(17*0.5)+(6*0.5)=x
"
],
"lSolutions": [ 
"11.5"
 ]
},
{
"iIndex": 206,
"sQuestion": "Sam got 9.0 pennies for washing clothes, and 7.0 quarters for mowing lawns. How much money does Sam have?",
"lEquations": [
"(9*0.01)+(7*0.25)=x
"
],
"lSolutions": [ 
"1.84"
 ]
},
{
"iIndex": 207,
"sQuestion": "When Joan was visited by the toothfairy, she received 14.0 each of quarters, half-dollars, and dimes. How much money did the toothfairy leave Joan?",
"lEquations": [
"14*(0.25+0.5+0.1)=x
"
],
"lSolutions": [ 
"11.9"
 ]
},
{
"iIndex": 208,
"sQuestion": "As Alyssa was searching through her couch cushions, she found 12.0 quarters, and 7.0 pennies in the couch. How much money in total does Alyssa have?",
"lEquations": [
"(12*0.25)+(7*0.01)=x
"
],
"lSolutions": [ 
"3.07"
 ]
},
{
"iIndex": 209,
"sQuestion": "On Wednesday, Joan spent 4.0 half-dollars playing pinball. The next day, she spent 14.0 half-dollars on pinball. What was the total amount Joan spent playing pinball?",
"lEquations": [
"(4*0.5)+(14*0.5)=x
"
],
"lSolutions": [ 
"9.0"
 ]
},
{
"iIndex": 210,
"sQuestion": "Tim got 3.0 nickels and 13.0 dimes for shining shoes, and in his tip jar found 7.0 dimes and 9.0 half-dollars. How much money did Tim get?",
"lEquations": [
"(3*0.05)+(13*0.1)+(7*0.1)+(9*0.5)=x
"
],
"lSolutions": [ 
"6.65"
 ]
},
{
"iIndex": 211,
"sQuestion": "While digging through her clothes for ice cream money, Joan found 15.0 dimes in her jacket, and 4.0 dimes in her shorts. How much money did Joan find?",
"lEquations": [
"(15*0.1)+(4*0.1)=x
"
],
"lSolutions": [ 
"1.9"
 ]
},
{
"iIndex": 212,
"sQuestion": "On Friday, Sam spent 2.0 pennies on ice cream. The next day, Sam spent 12.0 dimes on baseball cards. All in all, how much money did Sam spend?",
"lEquations": [
"(2*0.01)+(12*0.1)=x
"
],
"lSolutions": [ 
"1.22"
 ]
},
{
"iIndex": 213,
"sQuestion": "Joan purchased a basketball game for $5.20, and a racing game for $4.23. How much did Joan spend on video games?",
"lEquations": [
"5.20+4.23=x
"
],
"lSolutions": [ 
"9.43"
 ]
},
{
"iIndex": 214,
"sQuestion": "Mike joined his school's band. He bought a trumpet for $145.16, and a song book which was $5.84. How much did Mike spend at the music store?",
"lEquations": [
"145.16+5.84=x
"
],
"lSolutions": [ 
"151.0"
 ]
},
{
"iIndex": 215,
"sQuestion": "Alyssa bought some toys. She bought a football for $5.71, and spent $6.59 on marbles. In total, how much did Alyssa spend on toys?",
"lEquations": [
"5.71+6.59=x
"
],
"lSolutions": [ 
"12.3"
 ]
},
{
"iIndex": 216,
"sQuestion": "Keith loves trading cards. She bought 4.0 packs of Digimon cards for $4.45 each, and a deck of baseball cards for $6.06. How much did Keith spend on cards?",
"lEquations": [
"(4*4.45)+6.06=x
"
],
"lSolutions": [ 
"23.86"
 ]
},
{
"iIndex": 217,
"sQuestion": "Jessica spent $10.22 on a cat toy, and a cage cost her $11.73. What was the total cost of Jessica's purchases?",
"lEquations": [
"10.22+11.73=x
"
],
"lSolutions": [ 
"21.95"
 ]
},
{
"iIndex": 218,
"sQuestion": "Sara got fast food for lunch. Sara spent $5.36 on a hotdog and $5.10 on a salad. What was the total of the lunch bill?",
"lEquations": [
"5.36+5.10=x
"
],
"lSolutions": [ 
"10.46"
 ]
},
{
"iIndex": 219,
"sQuestion": "Jason went to the mall on Saturday to buy clothes. He spent $14.28 on shorts and $4.74 on a jacket. In total, how much money did Jason spend on clothing?",
"lEquations": [
"14.28+4.74=x
"
],
"lSolutions": [ 
"19.02"
 ]
},
{
"iIndex": 220,
"sQuestion": "Alyssa loves eating fruits. Alyssa paid $12.08 for grapes, and $9.85 for cherries. In total, how much money did Alyssa spend?",
"lEquations": [
"12.08+9.85=x
"
],
"lSolutions": [ 
"21.93"
 ]
},
{
"iIndex": 221,
"sQuestion": "Mary loves eating fruits. Mary paid $11.08 for berries, $14.33 for apples, and $9.31 for peaches. In total, how much money did she spend?",
"lEquations": [
"11.08+14.33+9.31=x
"
],
"lSolutions": [ 
"34.72"
 ]
},
{
"iIndex": 222,
"sQuestion": "Sandy went to the mall to buy clothes. She spent $13.99 on shorts, $12.14 on a shirt, and $7.43 on a jacket. How much money did Sandy spend on clothes?",
"lEquations": [
"13.99+12.14+7.43=x
"
],
"lSolutions": [ 
"33.56"
 ]
},
{
"iIndex": 223,
"sQuestion": "Jason joined his school's band. He bought a flute for $142.46, a music stand for $8.89, and a song book for $7. How much did Jason spend at the music store?",
"lEquations": [
"142.46+8.89+7=x
"
],
"lSolutions": [ 
"158.35"
 ]
},
{
"iIndex": 224,
"sQuestion": "Tom purchased a football game for $14.02, a strategy game for $9.46, and a Batman game for $12.04. How much did Tom spend on video games?",
"lEquations": [
"14.02+9.46+12.04=x
"
],
"lSolutions": [ 
"35.52"
 ]
},
{
"iIndex": 225,
"sQuestion": "Fred loves trading cards. He bought 2.0 packs of football cards for $2.73 each, a pack of Pokemon cards for $4.01, and a deck of baseball cards for $8.95. How much did Fred spend on cards?",
"lEquations": [
"(2*2.73)+4.01+8.95=x
"
],
"lSolutions": [ 
"18.42"
 ]
},
{
"iIndex": 226,
"sQuestion": "On Saturday, Sara spent $10.62 each on two tickets to a movie theater. She also rented a movie for $1.59, and bought a movie for $13.95. How much money in total did Sara spend on movies?",
"lEquations": [
"(2*10.62)+1.59=x
"
],
"lSolutions": [ 
"36.78"
 ]
},
{
"iIndex": 227,
"sQuestion": "Mike bought some toys. He bought marbles for $9.05, a football for $4.95, and spent $6.52 on a baseball. In total, how much did Mike spend on toys?",
"lEquations": [
"9.05+4.95+6.52=x
"
],
"lSolutions": [ 
"20.52"
 ]
},
{
"iIndex": 228,
"sQuestion": "Mary loves eating fruits. Mary paid $7.19 for berries, and $6.83 for peaches with a $20 bill. How much change did Mary receive?",
"lEquations": [
"(7.19+6.83)+x=20
"
],
"lSolutions": [ 
"5.98"
 ]
},
{
"iIndex": 229,
"sQuestion": "Sandy went to the mall on Saturday to buy clothes. She paid $9.24 on pants and $8.25 on a shirt with a $20 bill. How much money did Sandy get in change?",
"lEquations": [
"9.24+8.25+x=20
"
],
"lSolutions": [ 
"2.51"
 ]
},
{
"iIndex": 230,
"sQuestion": "Joan paid $8.77 on a cat toy, and a cage cost her $10.97 with a $20 bill. How much change did Joan receive?",
"lEquations": [
"8.77+10.97+x=20
"
],
"lSolutions": [ 
"0.26"
 ]
},
{
"iIndex": 231,
"sQuestion": "On Friday, Fred paid $5.92 each on two tickets to a movie theater. He also borrowed a movie for $6.79. Fred paid with a $20 bill. How much change did Fred receive?",
"lEquations": [
"(2*5.92)+6.79+x=20
"
],
"lSolutions": [ 
"1.37"
 ]
},
{
"iIndex": 232,
"sQuestion": "Sandy bought some toys. She bought a football for $9.14, and paid $6.81 on a baseball with a $20 bill. How much change did he receive from the purchase?",
"lEquations": [
"9.14+6.81+x=20
"
],
"lSolutions": [ 
"4.05"
 ]
},
{
"iIndex": 233,
"sQuestion": "A ship is filled with 5973.0 tons of cargo. It stops in the Bahamas, where sailors load 8723.0 more tons of cargo onboard. How many tons of cargo does the ship hold now?",
"lEquations": [
"5973+8723=x
"
],
"lSolutions": [ 
"14696.0"
 ]
},
{
"iIndex": 234,
"sQuestion": "Before December, customers buy 1346.0 ear muffs from the mall. During December, they buy 6444.0 more, and there are none left. In all, how many ear muffs do the customers buy?",
"lEquations": [
"1346+6444=x
"
],
"lSolutions": [ 
"7790.0"
 ]
},
{
"iIndex": 235,
"sQuestion": "Diane is a beekeeper. Last year, she harvested 2479.0 pounds of honey. This year, she bought some new hives and increased her honey harvest by 6085.0 pounds. How many pounds of honey did Diane harvest this year?",
"lEquations": [
"2479+6085=x
"
],
"lSolutions": [ 
"8564.0"
 ]
},
{
"iIndex": 236,
"sQuestion": "An oil pipe in the sea broke. Before engineers started to fix the pipe, 6522.0 liters of oil leaked into the water. While the engineers worked, the pipe leaked 5165.0 more liters of oil. In all, how many liters of oil leaked into the water?",
"lEquations": [
"6522+5165=x
"
],
"lSolutions": [ 
"11687.0"
 ]
},
{
"iIndex": 237,
"sQuestion": "A car company produced 3884.0 cars in North America and 2871.0 cars in Europe. How many cars is that in all?",
"lEquations": [
"3884+2871=x
"
],
"lSolutions": [ 
"6755.0"
 ]
},
{
"iIndex": 238,
"sQuestion": "Abe's family moved from the Bahamas to Japan, so they had convert their money into Japanese yen. Their checking account now has 6359.0 yen and their savings account now has 3485.0 yen. How many yen do they have?",
"lEquations": [
"6359+3485=x
"
],
"lSolutions": [ 
"9844.0"
 ]
},
{
"iIndex": 239,
"sQuestion": "There are 1986.0 books in Oak Grove's public library. In addition, there are 5106.0 books in its school libraries. How many books do the libraries in Oak Grove have overall?",
"lEquations": [
"1986+5106=x
"
],
"lSolutions": [ 
"7092.0"
 ]
},
{
"iIndex": 240,
"sQuestion": "There were originally 20817.0 houses in Lincoln County. During a housing boom, developers built 97741.0 more. How many houses are there now in Lincoln County?",
"lEquations": [
"20817+97741=x
"
],
"lSolutions": [ 
"118558.0"
 ]
},
{
"iIndex": 241,
"sQuestion": "A farmer estimates that he will harvest 48097.0 bushels of wheat. The weather is perfect during the growing season, so he harvests 684.0 more bushels of wheat than expected. How many bushels of wheat does the farmer harvest?",
"lEquations": [
"48097+684=x
"
],
"lSolutions": [ 
"48781.0"
 ]
},
{
"iIndex": 242,
"sQuestion": "Christina just transferred $69 out of her bank account. As a result, the account now has $26,935 left in it. How much money was in the account before the transfer?",
"lEquations": [
"x-69=26935
"
],
"lSolutions": [ 
"27004.0"
 ]
},
{
"iIndex": 243,
"sQuestion": "Last year at Newberg's airport, 14507.0 passengers landed on time. Unfortunately, 213.0 passengers landed late. In all, how many passengers landed in Newberg last year?",
"lEquations": [
"14507+213=x
"
],
"lSolutions": [ 
"14720.0"
 ]
},
{
"iIndex": 244,
"sQuestion": "A dust storm sweeps across the prairie. It covers 64535.0 acres of the prairie in dust, but leaves 522.0 acres untouched. How many acres does the prairie cover?",
"lEquations": [
"64535+522=x
"
],
"lSolutions": [ 
"65057.0"
 ]
},
{
"iIndex": 245,
"sQuestion": "Some insects called aphids attack a large farm. In response, the farmer releases ladybugs onto the fields. There are 12170.0 ladybugs with spots and 54912.0 ladybugs without spots. How many ladybugs are there in all?",
"lEquations": [
"12170+54912=x
"
],
"lSolutions": [ 
"67082.0"
 ]
},
{
"iIndex": 246,
"sQuestion": "Last year, 90171.0 people were born in a country, and 16320.0 people immigrated to it. How many new people began living in the country last year?",
"lEquations": [
"90171+16320=x
"
],
"lSolutions": [ 
"106491.0"
 ]
},
{
"iIndex": 247,
"sQuestion": "A ship full of grain crashes into a coral reef. By the time the ship is fixed, 49952.0 tons of grain have spilled into the water. Only 918.0 tons of grain remain onboard. How many tons of grain did the ship originally contain?",
"lEquations": [
"49952+918=x
"
],
"lSolutions": [ 
"50870.0"
 ]
},
{
"iIndex": 248,
"sQuestion": "To fill an order, the factory dyed 61921.0 yards of silk green and 49500.0 yards pink. How many yards of silk did it dye for that order?",
"lEquations": [
"61921+49500=x
"
],
"lSolutions": [ 
"111421.0"
 ]
},
{
"iIndex": 249,
"sQuestion": "A multi-national corporation has 2041.0 part-time employees and 63093.0 full-time employees. How many employees work for the corporation?",
"lEquations": [
"2041+63093=x
"
],
"lSolutions": [ 
"65134.0"
 ]
},
{
"iIndex": 250,
"sQuestion": "Each year, salmon travel upstream, going from the ocean to the rivers where they were born. This year, 712261.0 male and 259378.0 female salmon returned to their rivers. How many salmon made the trip?",
"lEquations": [
"712261+259378=x
"
],
"lSolutions": [ 
"971639.0"
 ]
},
{
"iIndex": 251,
"sQuestion": "A bathing suit manufacturer has a supply of 14797.0 bathing suits for men. In addition, it has 4969.0 bathing suits for women. How many bathing suits are available overall?",
"lEquations": [
"14797+4969=x
"
],
"lSolutions": [ 
"19766.0"
 ]
},
{
"iIndex": 252,
"sQuestion": "Before the recent housing boom, there were 1426.0 houses in Lawrence County. Now, there are 2000.0 houses. How many houses did developers build during the housing boom?",
"lEquations": [
"1426+x=2000
"
],
"lSolutions": [ 
"574.0"
 ]
},
{
"iIndex": 253,
"sQuestion": "A worker at a medical lab is studying blood samples. Two samples contained a total of 7341.0 blood cells. The first sample contained 4221.0 blood cells. How many blood cells were in the second sample?",
"lEquations": [
"7341=4221+x
"
],
"lSolutions": [ 
"3120.0"
 ]
},
{
"iIndex": 254,
"sQuestion": "So far, an orchard has sold a combined total of 9792.0 pounds of fresh and frozen fruit this season. If they have sold 3513.0 pounds of frozen fruit, how many pounds of fresh fruit have been sold so far?",
"lEquations": [
"9792=3513+x
"
],
"lSolutions": [ 
"6279.0"
 ]
}
]
