[

{
"iIndex": 1,
"sQuestion": "Joan found 70.0 seashells on the beach. she gave Sam some of her seashells. She has 27.0 seashell left. How many seashells did she give to Sam ?",
"lEquations": [
"70-x=27"
],
"lSolutions": [ 
43.0
 ]
},
{
"iIndex": 2,
"sQuestion": "There were 28.0 bales of hay in the barn. Tim stacked more bales in the barn today. There are now 54.0 bales of hay in the barn. How many bales did he store in the barn ?",
"lEquations": [
"28+x=54"
],
"lSolutions": [ 
26.0
 ]
},
{
"iIndex": 3,
"sQuestion": "After eating at the restaurant, Sally, Sam, and Alyssa decided to divide the bill evenly. If each person paid 45.0 dollars, what was the total of the bill ?",
"lEquations": [
"45*3=x"
],
"lSolutions": [ 
135.0
 ]
},
{
"iIndex": 4,
"sQuestion": "Mary is baking a cake. The recipe wants 8.0 cups of flour. She already put in 2.0 cups. How many more cups does she need to add ?",
"lEquations": [
"8=2+x"
],
"lSolutions": [ 
6.0
 ]
},
{
"iIndex": 5,
"sQuestion": "Sara's high school played 12.0 basketball games this year. The team won most of their games. They were defeated during 4.0 games. How many games did they win ?",
"lEquations": [
"12=x+4"
],
"lSolutions": [ 
8.0
 ]
},
{
"iIndex": 6,
"sQuestion": "There are 22.0 walnut trees currently in the park. Park workers will plant more walnut trees today. When the workers are finished there will be 55.0 walnut trees in the park. How many walnut trees did the workers plant today ?",
"lEquations": [
"22+x=55"
],
"lSolutions": [ 
33.0
 ]
},
{
"iIndex": 7,
"sQuestion": "Mike had 34.0 peaches left at his roadside fruit stand. He went to the orchard and picked more peaches to stock up the stand. There are now 86.0 peaches at the stand, how many did he pick ?",
"lEquations": [
"34+x=86"
],
"lSolutions": [ 
52.0
 ]
},
{
"iIndex": 8,
"sQuestion": "There were 6.0 roses in the vase. Mary cut some more roses from her flower garden. There are now 16.0 roses in the vase. How many roses did she cut ?",
"lEquations": [
"6+x=16"
],
"lSolutions": [ 
10.0
 ]
},
{
"iIndex": 9,
"sQuestion": "Benny bought a soft drink for 2.0 dollars and 5.0 candy bars. He spent a total of 27.0 dollars. How much did each candy bar cost ?",
"lEquations": [
"2+(5*x)=27"
],
"lSolutions": [ 
5.0
 ]
},
{
"iIndex": 10,
"sQuestion": "Alyssa spent half of her allowance going to the movies. She washed the family car and earned 8.0 dollars. What is her weekly allowance if she ended with 12.0 dollars ?",
"lEquations": [
"(x/2)+8=12"
],
"lSolutions": [ 
8.0
 ]
},
{
"iIndex": 11,
"sQuestion": "The sum of three consecutive even numbers is 162.0 What is the smallest of the three numbers ?",
"lEquations": [
"(3*x)+6=162"
],
"lSolutions": [ 
52.0
 ]
},
{
"iIndex": 12,
"sQuestion": "Sam had 79.0 dollars to spend on 9.0 books. After buying them he had 16.0 dollars. How much did each book cost ?",
"lEquations": [
"79-(9*x)=16"
],
"lSolutions": [ 
7.0
 ]
},
{
"iIndex": 13,
"sQuestion": "Oceanside Bike Rental Shop charges 17.0 dollars plus 7.0 dollars an hour for renting a bike. Tom paid 80.0 dollars to rent a bike. How many hours did he pay to have the bike checked out ?",
"lEquations": [
"17+(7*x)=80"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 14,
"sQuestion": "On Monday, 375.0 students went on a trip to the zoo. All 7.0 buses were filled and 4.0 students had to travel in cars. How many students were in each bus ?",
"lEquations": [
"375=(7*x)+4"
],
"lSolutions": [ 
53.0
 ]
},
{
"iIndex": 15,
"sQuestion": "Tom has 9.0 yellow balloons Sara has 8.0 yellow balloons. How many yellow balloons do they have in total ?",
"lEquations": [
"9+8=x"
],
"lSolutions": [ 
17.0
 ]
},
{
"iIndex": 16,
"sQuestion": "Sam had 9.0 dimes in his bank. His dad gave him 7.0 more dimes. How many dimes does Sam have now ?",
"lEquations": [
"9+7=x"
],
"lSolutions": [ 
16.0
 ]
},
{
"iIndex": 17,
"sQuestion": "A restaurant served 9.0 pizzas during lunch and 6.0 during dinner today. How many pizzas were served today ?",
"lEquations": [
"9+6=x"
],
"lSolutions": [ 
15.0
 ]
},
{
"iIndex": 18,
"sQuestion": "Joan found 6.0 seashells and Jessica found 8.0 seashells on the beach. How many seashells did they find together ?",
"lEquations": [
"6+8=x"
],
"lSolutions": [ 
14.0
 ]
},
{
"iIndex": 19,
"sQuestion": "Joan went to 4.0 football games this year. She went to 9.0 games last year. How many football games did Joan go to in all ?",
"lEquations": [
"4+9=x"
],
"lSolutions": [ 
13.0
 ]
},
{
"iIndex": 20,
"sQuestion": "Sally found 9.0 seashells, Tom found 7.0 seashells, and Jessica found 5.0 seashells on the beach. How many seashells did they find together ?",
"lEquations": [
"9+7+5=x"
],
"lSolutions": [ 
21.0
 ]
},
{
"iIndex": 21,
"sQuestion": "Tim's cat had kittens. He gave 3.0 to Jessica and 6.0 to Sara. He now has 9.0 kittens left. How many kittens did he have to start with ?",
"lEquations": [
"x-3-6=9"
],
"lSolutions": [ 
18.0
 ]
},
{
"iIndex": 22,
"sQuestion": "Joan has 9.0 blue balloons, Sally has 5.0 blue balloons, and Jessica has  2.0 blue balloons. How many blue balloons do they have in total ?",
"lEquations": [
"9+5+2=x"
],
"lSolutions": [ 
16.0
 ]
},
{
"iIndex": 23,
"sQuestion": "A restaurant served 5.0 cakes during lunch and 6.0 during dinner today. The restaurant served 3.0 cakes yesterday. How many cakes were served in total ?",
"lEquations": [
"5+6+3=x"
],
"lSolutions": [ 
14.0
 ]
},
{
"iIndex": 24,
"sQuestion": "Melanie picked 4.0 plums, Dan picked 9.0 plums, and Sally picked 3.0 plums from the plum tree. How many plums were picked in total ?",
"lEquations": [
"4+9+3=x"
],
"lSolutions": [ 
16.0
 ]
},
{
"iIndex": 25,
"sQuestion": "Sandy has 10.0 books, Benny has 24.0 books, and Tim has  33.0 books. How many books do they have together ?",
"lEquations": [
"10+24+33=x"
],
"lSolutions": [ 
67.0
 ]
},
{
"iIndex": 26,
"sQuestion": "There are 39.0 dogwood trees currently in the park. Park workers will plant  41.0 more dogwood trees today and 20.0 more dogwood trees tomorrow. How many dogwood trees will the park have when the workers are finished ?",
"lEquations": [
"39+41+20=x"
],
"lSolutions": [ 
100.0
 ]
},
{
"iIndex": 27,
"sQuestion": "Melanie had 19.0 dimes in her bank. Her dad gave her 39.0 dimes and her mother gave her 25.0 dimes. How many dimes does Melanie have now ?",
"lEquations": [
"19+39+25=x"
],
"lSolutions": [ 
83.0
 ]
},
{
"iIndex": 28,
"sQuestion": "Alyssa has 37.0 blue balloons, Sandy has 28.0 blue balloons, and Sally  has 39.0 blue balloons. How many blue balloons do they have in all ?",
"lEquations": [
"37+28+39=x"
],
"lSolutions": [ 
104.0
 ]
},
{
"iIndex": 29,
"sQuestion": "Mike has 35.0 books in his library. He bought several books at a yard sale over the weekend. He now has 56.0 books in his library. How many books did he buy at the yard sale ?",
"lEquations": [
"35+x=56"
],
"lSolutions": [ 
21.0
 ]
},
{
"iIndex": 30,
"sQuestion": "Sally had 13.0 peaches left at her roadside fruit stand. She went to the orchard and picked more peaches to stock up the stand. There are now 55.0 peaches at the stand, how many did she pick ?",
"lEquations": [
"13+x=55"
],
"lSolutions": [ 
42.0
 ]
},
{
"iIndex": 31,
"sQuestion": "There were a total of 7.0 football games this year. Melanie missed 4.0 of the games. How many football games did Melanie go to in all ?",
"lEquations": [
"7=4+x"
],
"lSolutions": [ 
3.0
 ]
},
{
"iIndex": 32,
"sQuestion": "Joan has 8.0 orange balloons  but lost 2.0 of them. How many orange balloons does Joan have now ?",
"lEquations": [
"8-2=x"
],
"lSolutions": [ 
6.0
 ]
},
{
"iIndex": 33,
"sQuestion": "Fred had 7.0 dimes in his bank. His sister borrowed 3.0 of his dimes. How many dimes does Fred have now ?",
"lEquations": [
"7-3=x"
],
"lSolutions": [ 
4.0
 ]
},
{
"iIndex": 34,
"sQuestion": "Mike has 87.0 baseball cards. Sam bought 13.0 of Mike's  baseball cards. How many baseball cards does Mike have now ?",
"lEquations": [
"87-13=x"
],
"lSolutions": [ 
74.0
 ]
},
{
"iIndex": 35,
"sQuestion": "Fred's high school played 616.0 baseball games this year. He attended  147.0 games. How many baseball games did Fred miss ?",
"lEquations": [
"616=147+x"
],
"lSolutions": [ 
469.0
 ]
},
{
"iIndex": 36,
"sQuestion": "Nancy goes fishing with Joan. They catch 18.0 trout.  If they equally split up the trout, how may will each one get ?",
"lEquations": [
"18/2=x"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 37,
"sQuestion": "Sandy worked 45.0 hours in the last five days. Assuming that she worked the same amount of hours each day, how long did she work each day ?",
"lEquations": [
"45/5=x"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 38,
"sQuestion": "A restaurant sold 63.0 hamburgers last week. How many hamburgers on average were sold each day ?",
"lEquations": [
"63/7=x"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 39,
"sQuestion": "There were a total of 27.0 soccer games during the three month season.  If the games are equally divided, how many soccer games are played a month ?",
"lEquations": [
"27/3=x"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 40,
"sQuestion": "Fred has 90.0 cents in his bank.  How many dimes does Fred have ?",
"lEquations": [
"90/10=x"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 41,
"sQuestion": "Fred has 110.0 blue marbles. Fred has 22.0 times more blue marbles than Tim. How many blue marbles does Tim have?",
"lEquations": [
"110/22=x"
],
"lSolutions": [ 
5.0
 ]
},
{
"iIndex": 42,
"sQuestion": "There are 390.0 students at a school. If each classroom holds 30.0 students, how many classrooms are needed at the school?",
"lEquations": [
"390=30*x"
],
"lSolutions": [ 
13.0
 ]
},
{
"iIndex": 43,
"sQuestion": "Tim has saved 2000.0 cents from selling lemonade.  How many dollars does Tim have?",
"lEquations": [
"2000/100=x"
],
"lSolutions": [ 
20.0
 ]
},
{
"iIndex": 44,
"sQuestion": "Nancy bought 615.0 crayons that came in packs of 15.0  How many packs of crayons did Nancy buy?",
"lEquations": [
"615/15=x"
],
"lSolutions": [ 
41.0
 ]
},
{
"iIndex": 45,
"sQuestion": "Mary earns $46 cleaning a home. How many homes did she clean, if she made 276.0 dollars?",
"lEquations": [
"46*x=276"
],
"lSolutions": [ 
6.0
 ]
},
{
"iIndex": 46,
"sQuestion": "Nancy, Melanie, Mary, and Alyssa each bought 540.0 baseball cards,  which come in packs of 20.0 How many packs of baseball cards do they have in all?",
"lEquations": [
"(4*540)/20=x"
],
"lSolutions": [ 
108.0
 ]
},
{
"iIndex": 47,
"sQuestion": "A teacher has 344.0 pieces of candy. If there are 43.0 students, and the candy is divided evenly, How many pieces will each student get?",
"lEquations": [
"344/43=x"
],
"lSolutions": [ 
8.0
 ]
},
{
"iIndex": 48,
"sQuestion": "There are 60.0 calories in a candy bar. How many dozen calories are there in 45.0 candy bars?",
"lEquations": [
"60*45=x*12"
],
"lSolutions": [ 
225.0
 ]
},
{
"iIndex": 49,
"sQuestion": "Sara saw 96.0 birds in a tree. How many dozen birds did Sara see?",
"lEquations": [
"96=x*12"
],
"lSolutions": [ 
8.0
 ]
},
{
"iIndex": 50,
"sQuestion": "Sally earns $25.00 for each house she cleans. If she cleans 96.0 houses, how many dozens of dollars will she make?",
"lEquations": [
"(25*96)=x*12"
],
"lSolutions": [ 
200.0
 ]
},
{
"iIndex": 51,
"sQuestion": "Sara has 192.0 golf balls. How many dozen golf balls does she have?",
"lEquations": [
"192=x*12"
],
"lSolutions": [ 
16.0
 ]
},
{
"iIndex": 52,
"sQuestion": "Keith bought 72.0 eggs from the store to bake some cakes.  How many dozen eggs did Keith buy?",
"lEquations": [
"72=x*12"
],
"lSolutions": [ 
6.0
 ]
},
{
"iIndex": 53,
"sQuestion": "Sara has saved 9.0 dollars from washing cars.  How many dozen quarters does Sara have?",
"lEquations": [
"9=(0.25*12)*x"
],
"lSolutions": [ 
3.0
 ]
},
{
"iIndex": 54,
"sQuestion": "Jason's shelves hold 45.0 books each. How many shelves will Jason need if Jason has 315.0 books?",
"lEquations": [
"45*x=315"
],
"lSolutions": [ 
7.0
 ]
},
{
"iIndex": 55,
"sQuestion": "Mike has 8.0 orange marbles, he gave Sam 4.0 of the marbles. How many orange marbles does he now have ?",
"lEquations": [
"8-4=x"
],
"lSolutions": [ 
4.0
 ]
},
{
"iIndex": 56,
"sQuestion": "Sara has 9.0 dozen golf balls. How many golf balls does she have ?",
"lEquations": [
"9*12=x"
],
"lSolutions": [ 
108.0
 ]
},
{
"iIndex": 57,
"sQuestion": "Jason had Pokemon cards. He gave 9.0 to his friends. He now has 4.0 Pokemon cards left. How many Pokemon cards did he have to start with ?",
"lEquations": [
"x-9=4"
],
"lSolutions": [ 
13.0
 ]
},
{
"iIndex": 58,
"sQuestion": "There are 4.0 children in the classroom, each student will get 2.0 pencils. How many pencils will the teacher have to give out ?",
"lEquations": [
"4*2=x"
],
"lSolutions": [ 
8.0
 ]
},
{
"iIndex": 59,
"sQuestion": "Joan bought 6.0 dozen eggs from the grocery store to bake some cakes.  How many eggs did Joan buy ?",
"lEquations": [
"6*12=x"
],
"lSolutions": [ 
72.0
 ]
},
{
"iIndex": 60,
"sQuestion": "Nancy has saved 4900.0 cents from selling lemonade.  How many dollars does Nancy have?",
"lEquations": [
"4900/100=x"
],
"lSolutions": [ 
49.0
 ]
},
{
"iIndex": 61,
"sQuestion": "Melanie goes fishing with Tom. Melanie catches 8.0 trout. Tom catches twice as many trout as Melanie. How many trout did Tom catch ?",
"lEquations": [
"8*2=x"
],
"lSolutions": [ 
16.0
 ]
},
{
"iIndex": 62,
"sQuestion": "Sara has saved 11.0 quarters from washing cars.  How many cents does Sara have ?",
"lEquations": [
"11*25=x"
],
"lSolutions": [ 
275.0
 ]
},
{
"iIndex": 63,
"sQuestion": "Sandy has 8.0 dozen books. Fred has 5.0 times more books than  Sandy. How many books does Fred have ?",
"lEquations": [
"(8*12)*5=x"
],
"lSolutions": [ 
480.0
 ]
},
{
"iIndex": 64,
"sQuestion": "Sally saw 1.0 dozen birds in a tree. How many birds did Sally see ?",
"lEquations": [
"1*12=x"
],
"lSolutions": [ 
12.0
 ]
},
{
"iIndex": 65,
"sQuestion": "Sally has 6.0 blue balloons. Fred has 3.0 times more  blue balloons than Sally. How many blue balloons does Fred have now ?",
"lEquations": [
"6*3=x"
],
"lSolutions": [ 
18.0
 ]
},
{
"iIndex": 66,
"sQuestion": "A restaurant made 9.0 hamburgers to serve during lunch. Only 3.0 were  actually served. How many hamburgers were left over from lunch ?",
"lEquations": [
"9=3+6"
],
"lSolutions": [ 
6.0
 ]
},
{
"iIndex": 67,
"sQuestion": "Dan picked 9.0 limes and gave Sara 4.0 of the limes.  How many limes does Dan have now ?",
"lEquations": [
"9-4=x"
],
"lSolutions": [ 
5.0
 ]
},
{
"iIndex": 68,
"sQuestion": "Joan decided to sell all of her old books. She gathered up 33.0 books to sell. She sold 26.0 books in a yard sale. How many books does Joan now have ?",
"lEquations": [
"33-26=x"
],
"lSolutions": [ 
7.0
 ]
},
{
"iIndex": 69,
"sQuestion": "Sam got 9.0 pennies for washing clothes, and 7.0 quarters for mowing lawns. How much money does Sam have?",
"lEquations": [
"(9*0.01)+(7*0.25)=x"
],
"lSolutions": [ 
1.84
 ]
},
{
"iIndex": 70,
"sQuestion": "When Joan was visited by the toothfairy, she received 14.0 each of quarters, half-dollars, and dimes. How much money did the toothfairy leave Joan?",
"lEquations": [
"14*(0.25+0.5+0.1)=x"
],
"lSolutions": [ 
11.9
 ]
},
{
"iIndex": 71,
"sQuestion": "On Wednesday, Joan spent 4.0 half-dollars playing pinball. The next day, she spent 14.0 half-dollars on pinball. What was the total amount Joan spent playing pinball?",
"lEquations": [
"(4*0.5)+(14*0.5)=x"
],
"lSolutions": [ 
9.0
 ]
},
{
"iIndex": 72,
"sQuestion": "On Friday, Sam spent 2.0 pennies on ice cream. The next day, Sam spent 12.0 dimes on baseball cards. All in all, how much money did Sam spend?",
"lEquations": [
"(2*0.01)+(12*0.1)=x"
],
"lSolutions": [ 
1.22
 ]
},
{
"iIndex": 73,
"sQuestion": "Joan purchased a basketball game for $5.20, and a racing game for $4.23. How much did Joan spend on video games?",
"lEquations": [
"5.20+4.23=x"
],
"lSolutions": [ 
9.43
 ]
},
{
"iIndex": 74,
"sQuestion": "Keith loves trading cards. She bought 4.0 packs of Digimon cards for $4.45 each, and a deck of baseball cards for $6.06. How much did Keith spend on cards?",
"lEquations": [
"(4*4.45)+6.06=x"
],
"lSolutions": [ 
23.86
 ]
},
{
"iIndex": 75,
"sQuestion": "Alyssa bought some toys. She bought a football for $5.71, and spent $6.59 on marbles. In total, how much did Alyssa spend on toys?",
"lEquations": [
"5.71+6.59=x"
],
"lSolutions": [ 
12.3
 ]
},
{
"iIndex": 76,
"sQuestion": "Mary loves eating fruits. Mary paid $11.08 for berries, $14.33 for apples, and $9.31 for peaches. In total, how much money did she spend?",
"lEquations": [
"11.08+14.33+9.31=x"
],
"lSolutions": [ 
34.72
 ]
},
{
"iIndex": 77,
"sQuestion": "Sandy went to the mall to buy clothes. She spent $13.99 on shorts, $12.14 on a shirt, and $7.43 on a jacket. How much money did Sandy spend on clothes?",
"lEquations": [
"13.99+12.14+7.43=x"
],
"lSolutions": [ 
33.56
 ]
},
{
"iIndex": 78,
"sQuestion": "Fred loves trading cards. He bought 2.0 packs of football cards for $2.73 each, a pack of Pokemon cards for $4.01, and a deck of baseball cards for $8.95. How much did Fred spend on cards?",
"lEquations": [
"(2*2.73)+4.01+8.95=x"
],
"lSolutions": [ 
18.42
 ]
},
{
"iIndex": 79,
"sQuestion": "On Saturday, Sara spent $10.62 each on two tickets to a movie theater. She also rented a movie for $1.59, and bought a movie for $13.95. How much money in total did Sara spend on movies?",
"lEquations": [
"(2*10.62)+1.59=x"
],
"lSolutions": [ 
36.78
 ]
},
{
"iIndex": 80,
"sQuestion": "Mary loves eating fruits. Mary paid $7.19 for berries, and $6.83 for peaches with a $20 bill. How much change did Mary receive?",
"lEquations": [
"(7.19+6.83)=20-x"
],
"lSolutions": [ 
5.98
 ]
},
{
"iIndex": 81,
"sQuestion": "A ship is filled with 5973.0 tons of cargo. It stops in the Bahamas, where sailors load 8723.0 more tons of cargo onboard. How many tons of cargo does the ship hold now?",
"lEquations": [
"5973+8723=x"
],
"lSolutions": [ 
14696.0
 ]
},
{
"iIndex": 82,
"sQuestion": "An oil pipe in the sea broke. Before engineers started to fix the pipe, 6522.0 liters of oil leaked into the water. While the engineers worked, the pipe leaked 5165.0 more liters of oil. In all, how many liters of oil leaked into the water?",
"lEquations": [
"6522+5165=x"
],
"lSolutions": [ 
11687.0
 ]
},
{
"iIndex": 83,
"sQuestion": "A car company produced 3884.0 cars in North America and 2871.0 cars in Europe. How many cars is that in all?",
"lEquations": [
"3884+2871=x"
],
"lSolutions": [ 
6755.0
 ]
},
{
"iIndex": 84,
"sQuestion": "Abe's family moved from the Bahamas to Japan, so they had convert their money into Japanese yen. Their checking account now has 6359.0 yen and their savings account now has 3485.0 yen. How many yen do they have?",
"lEquations": [
"6359+3485=x"
],
"lSolutions": [ 
9844.0
 ]
},
{
"iIndex": 85,
"sQuestion": "Christina just transferred $69 out of her bank account. As a result, the account now has $26,935 left in it. How much money was in the account before the transfer?",
"lEquations": [
"x-69=26935"
],
"lSolutions": [ 
27004.0
 ]
},
{
"iIndex": 86,
"sQuestion": "A ship full of grain crashes into a coral reef. By the time the ship is fixed, 49952.0 tons of grain have spilled into the water. Only 918.0 tons of grain remain onboard. How many tons of grain did the ship originally contain?",
"lEquations": [
"49952+918=x"
],
"lSolutions": [ 
50870.0
 ]
},
{
"iIndex": 87,
"sQuestion": "A multi-national corporation has 2041.0 part-time employees and 63093.0 full-time employees. How many employees work for the corporation?",
"lEquations": [
"2041+63093=x"
],
"lSolutions": [ 
65134.0
 ]
},
{
"iIndex": 88,
"sQuestion": "Each year, salmon travel upstream, going from the ocean to the rivers where they were born. This year, 712261.0 male and 259378.0 female salmon returned to their rivers. How many salmon made the trip?",
"lEquations": [
"712261+259378=x"
],
"lSolutions": [ 
971639.0
 ]
},
{
"iIndex": 89,
"sQuestion": "A worker at a medical lab is studying blood samples. Two samples contained a total of 7341.0 blood cells. The first sample contained 4221.0 blood cells. How many blood cells were in the second sample?",
"lEquations": [
"7341=4221+x"
],
"lSolutions": [ 
3120.0
 ]
}
]
